programming/php/smarty.html
---
title: "Smarty"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Smarty</title>
<!-- 2016-06-17 Fri 11:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">Smarty</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Smarty</a></li>
<li><a href="#sec-2">2. 文件</a></li>
<li><a href="#sec-3">3. 目录</a></li>
<li><a href="#sec-4">4. 语法</a>
<ul>
<li><a href="#sec-4-1">4.1. 注释</a></li>
<li><a href="#sec-4-2">4.2. 配置</a></li>
<li><a href="#sec-4-3">4.3. 示例</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 运算符</a></li>
<li><a href="#sec-6">6. 语句</a>
<ul>
<li><a href="#sec-6-1">6.1. <code>if</code></a></li>
<li><a href="#sec-6-2">6.2. <code>foreach</code></a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. Smarty 2</a></li>
<li><a href="#sec-6-2-2">6.2.2. Smarty 3</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. 示例</a></li>
<li><a href="#sec-8">8. 安装</a></li>
<li><a href="#sec-9">9. 资源</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Smarty</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> 部件化（componentize） </dt><dd>将网页分为多个独立部分、分别用模板文件控制的方法。<br  />
                            可以独立修改、复用到其他网页或在网页中调整位置。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 文件</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">后缀</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">模板</td>
<td class="left"><code>.tpl</code></td>
<td class="left">HTML 和 Smarty 标签</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">插件（plug-in）</td>
<td class="left"><code>.php</code></td>
<td class="left">表现层逻辑，定义模板中使用的变量</td>
</tr>
</tbody>
</table>

<p>
如果只显示静态内容，不需要插件，只需要模板。
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 目录</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>templates/</code></th>
<th scope="col" class="left"><code>.tpl</code> 模板文件</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>templates_c/</code></td>
<td class="left">编译 <code>.tpl</code> 文件后生成的 <code>.php</code> 文件</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">这些文件在 <code>.tpl</code> 被修改后重新生成</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>configs/</code></td>
<td class="left">配置文件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>cache/</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 语法</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 注释</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-smarty">{* Comment *}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 配置</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<label class="org-src-name">加载配置文件（路径为实例化 Smarty 对象时设置的 <code>config_dir</code> ）：</label>
<pre class="src src-smarty">{config_load file="site.conf"}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">读取配置文件中的变量：</label>
<pre class="src src-smarty">{#var#}
{$smarty.config.var}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 示例</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-smarty">{* Smarty *} // 模板注释，模板文件最好以此类注释开头
Hello {$name}, welcome to Smarty!
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 运算符</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>==</code> <code>eq</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>!=</code> <code>ne</code> <code>neq</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&gt;</code> <code>gt</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&lt;</code> <code>lt</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&gt;=</code> <code>ge</code> <code>gte</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&lt;=</code> <code>le</code> <code>lte</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>===</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>!</code> <code>not</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>%</code> <code>mod</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is (not) div by</code></td>
<td class="left"><code>$a % $b == 0</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is (not) even</code></td>
<td class="left"><code>$a % 2 == 0</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is (not) even by</code></td>
<td class="left"><code>($a / $b) % 2 == 0</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is (not) odd</code></td>
<td class="left"><code>$a % 2 != 0</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is (not) odd by</code></td>
<td class="left"><code>($a / $b) % 2 != 0</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 语句</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <code>if</code></h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-smarty">{if ...}
{elseif ...}
{else}
{/if}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> <code>foreach</code></h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Smarty 2</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">

<pre class="src src-smarty">{foreach from= key= item= name= }
{/foreach}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>from</code></th>
<th scope="col" class="left">Array</th>
<th scope="col" class="left">遍历的数组变量</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>key</code></td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>item</code></td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>name</code></td>
<td class="left">String</td>
<td class="left"><code>foreach</code> 遍历的名称</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <code>foreach</code> 变量</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>$smarty.foreach.&lt;name&gt;.index</code></th>
<th scope="col" class="left">当前索引，起始为 0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$smarty.foreach.&lt;name&gt;.iteration</code></td>
<td class="left">当前循环，起始为 1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$smarty.foreach.&lt;name&gt;.first</code></td>
<td class="left">当前是否是第一个元素</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$smarty.foreach.&lt;name&gt;.last</code></td>
<td class="left">当前是否是最后一个元素</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$smarty.foreach.&lt;name&gt;.show</code></td>
<td class="left">设为 <code>False</code> 时， <code>foreach</code> 不显示</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">如果存在 <code>foreachelse</code> ，显示之</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$smarty.foreach.&lt;name&gt;.total</code></td>
<td class="left">循环总次数</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Smarty 3</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">

<pre class="src src-smarty">{foreach $array as $item}
{/foreach}

{foreach $array as $key=&gt;$item}
{/foreach}

{break}

{continue}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> <code>foreach</code> 变量</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>$item@index</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$item@iteration</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$item@first</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$item@last</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$item@show</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$item@total</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 示例</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<label class="org-src-name">目录结构</label>
<pre class="src src-sh">project/
    cache/
    images/
    include/
        config.php          <span class="org-comment-delimiter"># </span><span class="org-comment">&#23450;&#20041;&#32593;&#31449;&#26681;&#30446;&#24405;&#12289;&#39033;&#30446;&#36335;&#24452;&#12289;Smarty &#36335;&#24452;</span>
        configs/
            site.conf       <span class="org-comment-delimiter"># </span><span class="org-comment">Smarty &#37197;&#32622;&#25991;&#20214;</span>
    index.php               <span class="org-comment-delimiter"># </span><span class="org-comment">&#23454;&#20363;&#21270; Application &#31867;&#65292;&#21152;&#36733; store_front.tpl</span>
    libs/
        smarty/             <span class="org-comment-delimiter"># </span><span class="org-comment">Smarty &#24211;&#25991;&#20214;</span>
    presentation/
        application.php     <span class="org-comment-delimiter"># </span><span class="org-comment">Smarty &#23376;&#31867;&#65292;&#29992;&#20110; Smarty &#21021;&#22987;&#21270;</span>
        templates/
            store_front.tpl <span class="org-comment-delimiter"># </span><span class="org-comment">&#39029;&#38754;&#27169;&#26495;</span>
        templates_c/
    styles/
        styles.css          <span class="org-comment-delimiter"># </span><span class="org-comment">&#26679;&#24335;</span>
        yui_styles.css      <span class="org-comment-delimiter"># </span><span class="org-comment">YUI &#21253;&#25991;&#20214;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>includ/config.php</code></label>
<pre class="src src-php"><span class="org-function-name">define</span>(<span class="org-string">'SITE_ROOT'</span>, <span class="org-function-name">dirname</span>(<span class="org-function-name">dirname</span>(<span class="org-constant">__FILE__</span>)));
<span class="org-function-name">define</span>(<span class="org-string">'PRESENTATION_DIR'</span>, <span class="org-constant">SITE_ROOT</span> . <span class="org-string">'/presentation/'</span>);
<span class="org-function-name">define</span>(<span class="org-string">'BUSINESS_DIR'</span>, <span class="org-constant">SITE_ROOT</span> . <span class="org-string">'/business/'</span>);
<span class="org-function-name">define</span>(<span class="org-string">'SMARTY_DIR'</span>, <span class="org-constant">SITE_ROOT</span> . <span class="org-string">'/libs/smarty/'</span>);
<span class="org-function-name">define</span>(<span class="org-string">'TEMPLATE_DIR'</span>, <span class="org-constant">PRESENTATION_DIR</span> . <span class="org-string">'templates'</span>);
<span class="org-function-name">define</span>(<span class="org-string">'COMPILE_DIR'</span>, <span class="org-constant">PRESENTATION_DIR</span> . <span class="org-string">'templates_c'</span>);
<span class="org-function-name">define</span>(<span class="org-string">'CONFIG_DIR'</span>, <span class="org-constant">SITE_ROOT</span> . <span class="org-string">'/include/configs'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>include/configs/site.conf</code></label>
<pre class="src src-code">site_title = "Site Title"
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>presentation/application.php</code></label>
<pre class="src src-php"><span class="org-keyword">require_once</span> <span class="org-constant">SMARTY_DIR</span> . <span class="org-string">'Smarty.class.php'</span>;
<span class="org-keyword">class</span> <span class="org-constant">A</span>pplication <span class="org-keyword">extends</span> <span class="org-constant">S</span>marty
{
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-constant">__</span>construct() <span class="org-comment-delimiter">// </span><span class="org-comment">&#23558;&#21019;&#24314; Smarty &#39029;&#38754;&#30340;&#26631;&#20934;&#26041;&#27861;&#23553;&#35013;&#22312;&#31867;&#20013;</span>
    {
        <span class="org-constant">parent</span>::<span class="org-function-name">Smarty</span>();
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">template_dir</span> = <span class="org-constant">TEMPLATE_DIR</span>;
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">compile_dir</span> = <span class="org-constant">COMPILE_DIR</span>;
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">config_dir</span> = <span class="org-constant">CONFIG_DIR</span>;
    }
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>index.php</code></label>
<pre class="src src-php"><span class="org-keyword">require_once</span> <span class="org-string">'include/config.php'</span>;
<span class="org-keyword">require_once</span> <span class="org-constant">PRESENTATION_DIR</span> . <span class="org-string">'application.php'</span>;
$<span class="org-variable-name">application</span> = <span class="org-keyword">new</span> <span class="org-constant">A</span>pplication();
$<span class="org-variable-name">application</span>-&gt;<span class="org-function-name">display</span>(<span class="org-string">'store_front.tpl'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>presentation/templates/store_front.tpl</code></label>
<pre class="src src-html">{* smarty *}
{config_load <span class="org-variable-name">file</span>=<span class="org-string">"site.conf"</span>}
&lt;<span class="org-keyword">!DOCTYPE</span> html&gt;
&lt;<span class="org-function-name">html</span>&gt;
    &lt;<span class="org-function-name">head</span>&gt;
        &lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">{#site_title#}</span></span>&lt;/<span class="org-function-name">title</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>styles/styles.css</code></label>
<pre class="src src-css"><span class="org-builtin">@import</span> <span class="org-string">"reset-min.css"</span>;
<span class="org-builtin">@import</span> <span class="org-string">"base-min.css"</span>;
<span class="org-builtin">@import</span> <span class="org-string">"fonts-min.css"</span>;
<span class="org-builtin">@import</span> <span class="org-string">"grids-min.css"</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 安装</h2>
<div class="outline-text-2" id="text-8">
<p>
1 - 下载 Smarty 库，将文件放入项目根目录或公用目录下的 <code>libs/smarty</code> 。
</p>

<div class="org-src-container">
<label class="org-src-name">2 - 将 Smarty 文件加入 <code>php.ini</code> 的包含路径：</label>
<pre class="src src-code">include_path = ".:/usr/share/php:/usr/local/lib/Smarty-v.e.r/libs/smarty/"
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">或定义常量 <code>SMARTY_DIR</code> ：</label>
<pre class="src src-php"><span class="org-function-name">define</span>(<span class="org-string">'SMARTY_DIR'</span>, <span class="org-string">'/usr/local/lib/Smarty-v.e.r/libs/smarty/'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">或直接以绝对路径加载文件：</label>
<pre class="src src-php"><span class="org-keyword">require_once</span>(<span class="org-string">'/usr/local/lib/Smarty-v.e.r/libs/smarty/Smarty.class.php'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">3 - 根目录下建立：</label>
<pre class="src src-sh">templates/
templates_c/ <span class="org-comment-delimiter"># </span><span class="org-comment">&#38656;&#35201;&#20889;&#26435;&#38480;</span>
configs/
cache/       <span class="org-comment-delimiter"># </span><span class="org-comment">&#38656;&#35201;&#20889;&#26435;&#38480;</span>
</pre>
</div>

<p>
4 - <code>.tpl</code> 文件放置在 <code>templates/</code> 目录下。
</p>

<div class="org-src-container">
<label class="org-src-name">5 - <code>index.php</code> 中初始化 Smarty，显示模板：</label>
<pre class="src src-php"><span class="org-keyword">require_once</span>(<span class="org-warning">SMARTY_DIR</span> . <span class="org-string">'Smarty.class.php'</span>);
$<span class="org-variable-name">smarty</span> = <span class="org-keyword">new</span> <span class="org-constant">S</span>marty();
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">setTemplateDir</span>(<span class="org-string">'/web/localhost/project/templates/'</span>);
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">setCompileDir</span>(<span class="org-string">'/web/localhost/project/templates_c/'</span>);
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">setConfigDir</span>(<span class="org-string">'/web/localhost/project/configs/'</span>);
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">setCacheDir</span>(<span class="org-string">'/web/localhost/project/cache/'</span>);
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">assign</span>(<span class="org-string">'name'</span>,<span class="org-string">'Your Name'</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">$smarty-&gt;debugging = true;</span>
$<span class="org-variable-name">smarty</span>-&gt;<span class="org-function-name">display</span>(<span class="org-string">'index.tpl'</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 资源</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li><a href="http://www.smarty.net/docs/en/">Smarty 3 Manual</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-06-17 Fri 11:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
